# ConConnection

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**id** | **int** |  | [optional]
**identifier** | **str** |  | [optional]
**name** | **str** |  | [optional]
**description** | **str** |  | [optional]
**analysis_type** | **ConAnalysisTypeEnum** |  | [optional]
**include_buckling** | **bool** |  | [optional]
**steel_edition** | **ConSteelCodeEditionEnum** |  | [optional]

## Example

```python
from ideastatica_connection_api.models.con_connection import ConConnection

# TODO update the JSON string below
json = "{}"
# create an instance of ConConnection from a JSON string
con_connection_instance = ConConnection.from_json(json)
# print the JSON string representation of the object
print(con_connection_instance.to_json())

# convert the object into a dict
con_connection_dict = con_connection_instance.to_dict()
# create an instance of ConConnection from a dict
con_connection_from_dict = ConConnection.from_dict(con_connection_dict)
```
[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)